In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'city':['Alma','Brian Head','Fox Park'],'altitude':[3158,3000, 2762]})

In [5]:
# use mapping to add columns to existing dataframe

state_map = {'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming'}

In [6]:
dframe['state'] = dframe['city'].map(state_map)

In [7]:
dframe['state']

0    Colorado
1        Utah
2     Wyoming
Name: state, dtype: object

In [8]:
dframe

         city  altitude     state
0        Alma      3158  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2762   Wyoming